#interpolate()..part2

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book6.csv')
df

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023         NaN      6       NaN
3  04-07-2023         NaN      7       NaN
4  05-07-2023       105.0      8       6.0

In [4]:
df.interpolate()

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0

In [6]:
df.dtypes

date           object
student_id    float64
class           int64
study hr      float64
dtype: object

In [7]:
df.interpolate(limit=1)

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\1270544217.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit=1)

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023         NaN      7       NaN
4  05-07-2023       105.0      8       6.0

In [10]:
df.interpolate(limit=1,limit_direction='backward') #takes by default forward

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\3443271525.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit=1,limit_direction='backward') #takes by default forward

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023         NaN      6       NaN
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0

In [11]:
df.interpolate(limit=1,limit_direction='both') #takes by default forward

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\3211511187.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit=1,limit_direction='both') #takes by default forward

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0

In [12]:
df.interpolate(limit_area='inside')

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\2930091247.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_area='inside')

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0

In [13]:
df.interpolate(limit_area='outside')

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\1653127404.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_area='outside')

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023         NaN      6       NaN
3  04-07-2023         NaN      7       NaN
4  05-07-2023       105.0      8       6.0

In [18]:
df.interpolate(inplace=True)#we have to value parameter with it but bydefault interpolate filled the missing value by method='linear'
df

C:\Users\AS\AppData\Local\Temp\ipykernel_2548\2001019460.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(inplace=True)#we have to value parameter with it but bydefault interpolate filled the missing value by method='linear'

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0

In [19]:
df

         date  student_id  class  study hr
0  01-07-2023       101.0      4       2.0
1  02-07-2023       102.0      5       3.0
2  03-07-2023       103.0      6       4.0
3  04-07-2023       104.0      7       5.0
4  05-07-2023       105.0      8       6.0